#+TITLE: pxrac-1969-odds-contract-fix
NOTE: vendortimestamputc is stored as a number in DDB currently and we format it
as a string, but that gives us the weird isoformat "T" in the middle of the
string and it's not clear that's what we should be doing.
*** /healthcheck
#+begin_src restclient
GET https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/healthcheck
#+end_src

#+RESULTS:
#+begin_example
,#+BEGIN_SRC html
I am Alive!
<!-- GET https://live-scoring-dev-pxrac-1969-too-many-payloads.feeds-dev.aws.phoenix/odds-api/healthcheck -->
<!-- HTTP/1.1 200 OK -->
<!-- Date: Tue, 03 Mar 2020 04:07:13 GMT -->
<!-- Content-Type: text/html; charset=utf-8 -->
<!-- Content-Length: 11 -->
<!-- Connection: keep-alive -->
<!-- Server: nginx/1.15.6 -->
<!-- Request duration: 4.438070s -->
,#+END_SRC
#+end_example


